{"format": "graph-model", "generatedBy": "2.16.1", "convertedBy": "TensorFlow.js Converter v4.18.0", "signature": {"inputs": {"dense_24_input": {"name": "dense_24_input:0", "dtype": "DT_DOUBLE", "tensorShape": {"dim": [{"size": "-1"}, {"size": "19"}]}}}, "outputs": {"dense_27": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/sequential_6/dense_24/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "19"}, {"size": "144"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_6/dense_24/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "144"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_6/dense_25/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "144"}, {"size": "72"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_6/dense_25/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "72"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_6/dense_26/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "72"}, {"size": "36"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_6/dense_26/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "36"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_6/dense_27/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "36"}, {"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_6/dense_27/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "dense_24_input", "op": "Placeholder", "attr": {"dtype": {"type": "DT_DOUBLE"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "19"}]}}}}, {"name": "StatefulPartitionedCall/sequential_6/dense_24/Cast", "op": "Cast", "input": ["dense_24_input"], "attr": {"Truncate": {"b": false}, "DstT": {"type": "DT_FLOAT"}, "SrcT": {"type": "DT_DOUBLE"}}}, {"name": "StatefulPartitionedCall/sequential_6/dense_24/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_6/dense_24/Cast", "StatefulPartitionedCall/sequential_6/dense_24/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_6/dense_24/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "transpose_a": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "transpose_b": {"b": false}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "leakyrelu_alpha": {"f": 0.2}}}, {"name": "StatefulPartitionedCall/sequential_6/dense_25/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_6/dense_24/Relu", "StatefulPartitionedCall/sequential_6/dense_25/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_6/dense_25/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "transpose_b": {"b": false}, "leakyrelu_alpha": {"f": 0.2}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}}}, {"name": "StatefulPartitionedCall/sequential_6/dense_26/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_6/dense_25/Relu", "StatefulPartitionedCall/sequential_6/dense_26/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_6/dense_26/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "num_args": {"i": "1"}, "T": {"type": "DT_FLOAT"}, "epsilon": {"f": 0.0}, "leakyrelu_alpha": {"f": 0.2}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_6/dense_27/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_6/dense_26/Relu", "StatefulPartitionedCall/sequential_6/dense_27/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_6/dense_27/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}, "leakyrelu_alpha": {"f": 0.2}, "transpose_a": {"b": false}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/sequential_6/dense_27/Relu"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 1766}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/sequential_6/dense_24/MatMul/ReadVariableOp", "shape": [19, 144], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_6/dense_24/BiasAdd/ReadVariableOp", "shape": [144], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_6/dense_25/MatMul/ReadVariableOp", "shape": [144, 72], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_6/dense_25/BiasAdd/ReadVariableOp", "shape": [72], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_6/dense_26/MatMul/ReadVariableOp", "shape": [72, 36], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_6/dense_26/BiasAdd/ReadVariableOp", "shape": [36], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_6/dense_27/MatMul/ReadVariableOp", "shape": [36, 1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_6/dense_27/BiasAdd/ReadVariableOp", "shape": [1], "dtype": "float32"}]}]}